{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8ea1ea34",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/_n/46drt9kd1_76dqk_vj0xk9qm0000gn/T/ipykernel_10008/1426366927.py:4: LangChainDeprecationWarning: The class `Neo4jGraph` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the `langchain-neo4j package and should be used instead. To use it run `pip install -U `langchain-neo4j` and import as `from `langchain_neo4j import Neo4jGraph``.\n",
      "  graph = Neo4jGraph(\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ Connected to Neo4j\n"
     ]
    }
   ],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "# Connect to Neo4j\n",
    "graph = Neo4jGraph(\n",
    "    url=\"neo4j+s://f5886a71.databases.neo4j.io\",\n",
    "    username=\"neo4j\",\n",
    "    password=\"fFCqS5-Ak3ZLppY0p1e2rrL1ZN_FJwt7oH_McxlCh5o\"\n",
    ")\n",
    "\n",
    "champions_query = \"\"\"\n",
    "MATCH (c:Champion)-[r1]->(n1)\n",
    "OPTIONAL MATCH (n1)-[r2]->(n2)\n",
    "RETURN c, r1, n1, r2, n2\n",
    "\"\"\"\n",
    "\n",
    "print(\"✓ Connected to Neo4j\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "97aa2895",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[#DCE1]  _: <CONNECTION> error: Failed to read from defunct connection ResolvedIPv4Address(('34.126.64.110', 7687)) (ResolvedIPv4Address(('34.126.64.110', 7687))): TimeoutError(60, 'Operation timed out')\n",
      "Unable to retrieve routing information\n",
      "Transaction failed and will be retried in 1.063156913677555s (Unable to retrieve routing information)\n",
      "[#DCE2]  _: <CONNECTION> error: Failed to read from defunct connection IPv4Address(('si-f5886a71-8c08.production-orch-0064.neo4j.io', 7687)) (ResolvedIPv4Address(('34.126.64.110', 7687))): TimeoutError(60, 'Operation timed out')\n",
      "Transaction failed and will be retried in 2.0741309029460546s (Failed to read from defunct connection IPv4Address(('si-f5886a71-8c08.production-orch-0064.neo4j.io', 7687)) (ResolvedIPv4Address(('34.126.64.110', 7687))))\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Champion {id: INTEGER, name: STRING, title: STRING, damageType: STRING, attackType: STRING, difficulty: INTEGER}\n",
      "Role {name: STRING}\n",
      "Ability {id: STRING, name: STRING, slot: STRING, description: STRING}\n",
      "AttackType {name: STRING}\n",
      "CrowdControl {name: STRING}\n",
      "DamageType {name: STRING}\n",
      "EffectType {name: STRING}\n",
      "Stat {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Champion)-[:HAS_ROLE]->(:Role)\n",
      "(:Champion)-[:HAS_ABILITY]->(:Ability)\n",
      "(:Champion)-[:ATTACKS_WITH]->(:AttackType)\n",
      "(:Ability)-[:APPLIES]->(:CrowdControl)\n",
      "(:Ability)-[:DEALS]->(:DamageType)\n",
      "(:Ability)-[:SCALES_WITH]->(:Stat)\n",
      "(:Ability)-[:HAS_EFFECT]->(:EffectType)\n"
     ]
    }
   ],
   "source": [
    "graph.refresh_schema()\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "73d18d2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_classic.chains import GraphCypherQAChain\n",
    "\n",
    "llm = ChatOpenAI(model_name=\"gpt-4\", temperature=0)\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph, llm=llm, verbose=True, allow_dangerous_requests=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2fc6893d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (c:Champion)-[:HAS_ROLE]->(r:Role) WHERE r.name IN ['Mage', 'Tank'] \n",
      "WITH c, COUNT(r) AS rolesCount \n",
      "WHERE rolesCount = 2 \n",
      "RETURN c.name\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[#DE8D]  _: <CONNECTION> error: Failed to read from defunct connection ResolvedIPv4Address(('34.126.64.110', 7687)) (ResolvedIPv4Address(('34.126.64.110', 7687))): TimeoutError(60, 'Operation timed out')\n",
      "Unable to retrieve routing information\n",
      "Transaction failed and will be retried in 0.983943378302075s (Unable to retrieve routing information)\n",
      "[#DE36]  _: <CONNECTION> error: Failed to read from defunct connection IPv4Address(('si-f5886a71-8c08.production-orch-0064.neo4j.io', 7687)) (ResolvedIPv4Address(('34.126.64.110', 7687))): TimeoutError(60, 'Operation timed out')\n",
      "Transaction failed and will be retried in 1.836071056362587s (Failed to read from defunct connection IPv4Address(('si-f5886a71-8c08.production-orch-0064.neo4j.io', 7687)) (ResolvedIPv4Address(('34.126.64.110', 7687))))\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Galio'}, {'c.name': 'Nunu & Willump'}, {'c.name': 'Singed'}, {'c.name': \"Cho'Gath\"}, {'c.name': 'Malphite'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'query': 'list Champions that have both role Mage and Tank',\n",
       " 'result': \"Galio, Nunu & Willump, Singed, Cho'Gath, and Malphite are champions that have both Mage and Tank roles.\"}"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "response = chain.invoke({\"query\": \"list Champions that have both roles Mage and Tank\"})\n",
    "response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d0cfdfba",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
